app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    # binding.pry
    @artists = Artist.all

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bob Marley"], ["created_at", "2019-01-29 19:11:02.479056"], ["updated_at", "2019-01-29 19:11:02.479056"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save